# SteelElemWeldMainRootopening Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemWeldMainRootopening Property
ParameterTypeId Class See Also
---
"Main Root Opening"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemWeldMainRootopening { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemWeldMainRootopening As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemWeldMainRootopening {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace